import { IoQrCode } from "react-icons/io5";
import { FaDatabase, FaMobileAlt, FaChartPie, FaPalette } from "react-icons/fa";
import { MdElectricBolt } from "react-icons/md";

export const LINKS = [
  { name: "المميزات", url: "#features" },
  { name: "كيف نعمل", url: "#how-it-works" },
  { name: "الاسعار", url: "#pricing" },
  { name: "الاسئلة الشائعة", url: "#qustions" },
];

export const FEATURES = [
  {
    title: "مولد باركود (QR) ديناميكي",
    text: "قم بتوليد كود QR خاص بكل طاولة أو كود عام للمطعم. الزبون يمسح الكود ويستعرض المنيو بدون تحميل أي تطبيق.",
    Icon: IoQrCode,
    className: "text-brand-500",
  },
  {
    title: "دعم متعدد العملات",
    text: "أضف أسعارك بالعملة المحلية (ل.س) والدولار ($). يمكن للزبون التبديل بين العملات بضغطة زر واحدة لمعرفة السعر بدقة.",
    Icon: FaDatabase,
    className: "text-blue-500",
  },
  {
    title: "تحديث لحظي للأسعار والأصناف",
    text: "تعديل الأسعار وإخفاء الأصناف المنتهية يتم في ثوانٍ وينعكس مباشرة على هواتف الزبائن دون الحاجة لإعادة طباعة المنيو.",
    Icon: MdElectricBolt,
    className: "text-emerald-500",
  },
  {
    title: "تصميم متجاوب وعصري",
    text: "منيو رقمي مصمم خصيصاً ليناسب جميع الشاشات مع تجربة مستخدم (UX) فائقة السهولة تزيد من شهية الزبائن وتضاعف طلباتهم.",
    Icon: FaMobileAlt,
    className: "text-amber-500 ",
  },
  {
    title: "إحصائيات وتقارير ذكية",
    text: "تعرف على الأصناف الأكثر مبيعاً، وتتبع عدد مرات مسح الكود يومياً، لتحسين قائمتك وزيادة أرباحك بناءً على بيانات حقيقية.",
    Icon: FaChartPie,
    className: "text-purple-500 ",
  },
  {
    title: "الطلب المباشر من الطاولة",
    text: "يمكن للزبائن تجميع طلباتهم وإرسالها مباشرة إلى المطبخ أو نظام الكاشير لتقليل وقت الانتظار وتخفيف الضغط عن الويترز",
    Icon: FaPalette,
    className: "text-rose-500 ",
  },
];

export const STEPS = [
  {
    number: "1",
    title: "أنشئ حسابك",
    description:
      "سجل مطعمك في ثوانٍ وادخل إلى لوحة التحكم الخاصة بك للبدء في تجهيز القائمة.",
  },
  {
    number: "2",
    title: "أضف أقسامك وأصنافك",
    description:
      "قم برفع صور جذابة لوجباتك، وحدد الأسعار والتفاصيل بكل سهولة وبدون خبرة برمجية.",
  },
  {
    number: "3",
    title: "اطبع الكود وانطلق",
    description:
      "قم بتحميل أكواد QR، اطبعها وضعها على طاولاتك ليستمتع زبائنك بتجربة طلب عصرية.",
  },
];

export const FAQ = [
  {
    question:"كيف تعمل ميزة تغيير العملة (ل.س والدولار)؟",
    ans: "لا أبداً! بمجرد أن يفتح الزبون كاميرا هاتف الجوال ويمسح كود QR الموجود على الطاولة، يفتح المنيو تفاعلياً وبشكل فوري داخل المتصفح.",
  },
  {
    question: "هل يحتاج الزبون لتحميل أي تطبيق لمشاهدة المنيو؟",
    ans: " يمكنك إما تحديد سعر كل وجبة بالعملتين يدوياً من لوحة التحكم، أو تحديد سعر بالدولار وتحديد سعر الصرف اليومي لليرة، ليقوم النظام بالتحويل التلقائي بضغطة زر أمام العميل.",
  },
  {
    question: "هل توجد أي عمولة على الطلبات أو المبيعات؟",
    ans: " صفر عمولة! جميع مبيعات مطعمك وأرباحك ملك لك 100%. نحن نقدم الخدمة مقابل اشتراك ثابت واضح بدون أي رسوم خفية.",
  },
];